// 1 - Користувач вводить суму вкладу в банк на 2 місяці, з процентною ставкою депозиту 5 % річних.
// Вивести суму нарахованих відсотків.


let deposit = prompt("Введіть суму вкладу:");
let annualInterest = 0.05;
let months = 2;
let interest = deposit * (annualInterest / 12) * months;
console.log("Сума нарахованих відсотків за вкладом за 2 місяці " + interest);

alert(`Сума нарахованих відсотків за вкладом за 2 місяці становить ${interest}`);

// 2 -  Що повернуть вирази:
//     2 && 0 && 3
//     2 || 0 || 3
//     2 && 0 || 3

console.log(2 && 0 && 3); // виведе 0
console.log(2 || 0 || 3); // виведе 2
console.log(2 && 0 || 3); // виведе 3